{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'cd79f572971c58784ca72551af29af3a63da9168'"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim",
      "version": "'0a5de4da015a175f416d6ef1eda84661623e0500'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'c2526f1cde528a66e086ab1668e996d162c75f4f'"
    },
    "crates.nvim": {
      "src": "https://github.com/saecki/crates.nvim",
      "version": "'ac9fa498a9edb96dc3056724ff69d5f40b898453'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'7fa433a83118a70fe24c1ce88d5f0bd3453c0970'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'9f3c6dd7868bcc116e9c1c1929ce063b978fa519'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim",
      "version": "'47f91c416daef12db467145e16bed5bbfe00add8'"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim",
      "version": "'44d1e90e1f66e077268191e3ee9d2ac97cc18e65'"
    },
    "mini.icons": {
      "src": "https://github.com/echasnovski/mini.icons",
      "version": "'68c178e0958d95b3977a771f3445429b1bded985'"
    },
    "mini.pairs": {
      "src": "https://github.com/echasnovski/mini.pairs",
      "version": "'4089aa6ea6423e02e1a8326a7a7a00159f6f5e04'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'4d9466677a5ceadef104eaa0fe08d60d91c4e9a7'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd5226c2f76c951fc8ed5923d85e4de065e509'"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'fe7cfe9800a182274d0f868a74b7263b8c0c020b'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'ad7d9580338354ccc136e5b8f0aa4f880434dcdc'"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim",
      "version": "'31e3c38ce9b29781e4422fc0322eb0a21f4e8668'"
    },
    "trim.nvim": {
      "src": "https://github.com/cappyzawa/trim.nvim",
      "version": "'765360a6f6ac732f4c78c5c694f4b892a55b53ec'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'3aab2147e74890957785941f0c1ad87d0a44c15a'"
    },
    "windsurf.vim": {
      "src": "https://github.com/Exafunction/windsurf.vim",
      "version": "'3c0a4f8a7be75113a6e19be13b7cc37210d6e26a'"
    }
  }
}